import copy
a = [["ABC"]]
c = copy.copy(a)
print("原始a: ", a,"-->", id(a))
print("原始a内的元素a[0]: ", a[0],"-->", id(a[0]))
print("原始a内的元素a[0][0]: ", a[0][0],"-->", id(a[0][0]))
print("浅拷贝c: ", c,"-->", id(c))
print("浅拷贝c的元素c[0]: ", c[0],"-->", id(c[0]))
print("浅拷贝c的元素c[0][0]: ", c[0][0],"-->", id(c[0][0]))

print("--------------------------------------------")
print("只修改a内的元素a[0],a[0][0]='DEF'")
a[0][0]="DEF"
print("原始a: ", a,"-->", id(a))
print("原始a内的元素a[0]: ", a[0],"-->", id(a[0]))
print("原始a内的元素a[0][0]: ", a[0][0],"-->", id(a[0][0]))
print("浅拷贝c: ", c,"-->", id(c))
print("浅拷贝c的元素c[0]: ", c[0],"-->", id(c[0]))
print("浅拷贝c的元素c[0][0]: ", c[0][0],"-->", id(c[0][0]))
print("--------------------------------------------")
print("修改这个对象a,a=['GHI']")
a[0]=["GHI"]
print("原始a: ", a,"-->", id(a))
print("原始a内的元素a[0]: ", a[0],"-->", id(a[0]))
print("原始a内的元素a[0][0]: ", a[0][0],"-->", id(a[0][0]))
print("浅拷贝c: ", c,"-->", id(c))
print("浅拷贝c的元素c[0]: ", c[0],"-->", id(c[0]))
print("浅拷贝c的元素c[0][0]: ", c[0][0],"-->", id(c[0][0]))
print("--------------------------------------------")
b=[["XYZ"]]
print("原始b: ", b,"-->", id(b))
print("原始b内的元素b[0]: ", b[0],"-->", id(b[0]))
print("原始b内的元素b[0][0]: ", b[0][0],"-->", id(b[0][0]))
print("--------------------------------------------")
b[0]=["123"]
print("原始b: ", b,"-->", id(b))
print("原始b内的元素b[0]: ", b[0],"-->", id(b[0]))
print("原始b内的元素b[0][0]: ", b[0][0],"-->", id(b[0][0]))
print("--------------------------------------------")
e=[[["XYZ"]]]
print("原始e: ", e,"-->", id(e))
print("原始e内的元素e[0]: ", e[0],"-->", id(e[0]))
print("原始e内的元素e[0][0]: ", e[0][0],"-->", id(e[0][0]))
print("原始e内的元素e[0][0][0]: ", e[0][0][0],"-->", id(e[0][0][0]))
print("--------------------------------------------")
e[0][0]=["123"]
print("原始e: ", e,"-->", id(e))
print("原始e内的元素e[0]: ", e[0],"-->", id(e[0]))
print("原始e内的元素e[0][0]: ", e[0][0],"-->", id(e[0][0]))
print("原始e内的元素e[0][0][0]: ", e[0][0][0],"-->", id(e[0][0][0]))

d=["a"]
print(id(d))
print(id(d[0]))
d=["b"]
print(id(d))
print(id(d[0]))
d[0]="c"
print(id(d))
print(id(d[0]))
print("--------------------------------------------")
g=[["1"]]
print(id(g))
print("-",id(g[0]))
print("--",id(g[0][0]))
# g[0]="f"
# print(id(g))
# print("-",id(g[0]))
# g[0]=["f"]
# print(id(g))
# print("-",id(g[0]))
# g[0]=[["f"]]
# print(id(g))
# print("-",id(g[0]))
g[0]="f"
print(id(g))
print("-",id(g[0]))
print("--",id(g[0][0]))
# g[0][0]="f"
# print(id(g))
# print("-",id(g[0]))
# g[0][0]="f"
# print(g)
# print(id(g))
# print("-",id(g[0]))
# print("--",id(g[0][0]))
print("--------------------------------------------")
a=["test"]
print(id(a))
a=["test_2"]
print(id(a))
